tutorials/mesh/moveDynamicMesh/rotorDisk_inclined/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          dynamicMeshDict;
}

dynamicFvMesh   staticFvMesh;

motionSolverLibs ( fvMotionSolvers );

motionSolver    displacementPointSmoothing;

displacementPointSmoothingCoeffs
{
    pointSmoother   geometricElementTransform;
    transformationParameter 0.667;
    nPointSmootherIter 10;
}


// ************************************************************************* //
